In [1]:
import mysql.connector as conn
import pandas as pd
db = conn.connect(
    host='localhost',
    user='root',
    password='123456789zxcvbnm',
    database = 'shop',
)

# 创建游标对象，以便执行 SQL 语句
cursor = db.cursor(buffered=True)

##### 练习一

In [3]:
### 创建表
create_table_employee = '''CREATE TABLE Employee
                           (Id              INTEGER   NOT NULL,
                            Name            VARCHAR(100)   NOT NULL,
                            Salary          INTEGER   NOT NULL,
                            DepartmentId    INTEGER   NOT NULL); '''
cursor.execute(create_table_employee)
db.commit()

In [6]:
### 插入数据到 Employee 表
insert_data_em = '''
                    INSERT INTO Employee (Id, Name, Salary, DepartmentId) VALUES (%s, %s, %s, %s)
                 '''

data = [
        (1, 'Joe', 70000, 1),
        (2, 'Henry', 80000, 2),
        (3, 'Sam', 60000, 2),
        (4, 'Max', 90000, 1)
        ]

cursor.executemany(insert_data_em, data)
db.commit()

In [7]:
### 创建表 Department 
create_table_department = '''
                             CREATE TABLE IF NOT EXISTS Department
                             (Id   INT NOT NULL,
                              Name VARCHAR(100) NOT NULL,
                              PRIMARY KEY (Id)
                             );
                          '''
cursor.execute(create_table_department)
db.commit()

In [8]:
### 向表 Department 插入数据
insert_data_department = '''
                            INSERT INTO Department (Id, Name) VALUES
                                (1, 'IT'),
                                (2, 'Sales');
                         '''
cursor.execute(insert_data_department)
db.commit()

In [9]:
# 读取 Employee 表的内容
select_all_em = '''SELECT *
                   FROM Employee; '''
cursor.execute(select_all_em)
res = cursor.fetchall()
df_em = pd.DataFrame(res, columns=cursor.column_names)
df_em

   Id   Name  Salary  DepartmentId
0   1    Joe   70000             1
1   2  Henry   80000             2
2   3    Sam   60000             2
3   4    Max   90000             1

In [10]:
select_all_dep = '''SELECT *
                   FROM Department; '''
cursor.execute(select_all_dep)
res = cursor.fetchall()
df_dep = pd.DataFrame(res, columns=cursor.column_names)
df_dep

   Id   Name
0   1     IT
1   2  Sales

In [19]:
MAX_query = '''
            SELECT 
                d.Name AS Department,
                e.Name AS Employee,
                e.Salary
            FROM 
                Employee e
            INNER JOIN 
                Department d ON e.DepartmentId = d.Id
            WHERE e.Salary IN (SELECT MAX(Salary)
                               FROM Employee
                               GROUP BY DepartmentId)
    '''
cursor.execute(query)
res = cursor.fetchall()

df_query = pd.DataFrame(res, columns=cursor.column_names)
df_query

  Department Employee  Salary
0      Sales    Henry   80000
1         IT      Max   90000